#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil expand-links:t f:t
#+options: inline:t num:t p:nil pri:nil prop:nil stat:t tags:t
#+options: tasks:t tex:t timestamp:t title:t toc:t todo:t |:t
#+title: GUIA PARA EL USO DE EMACS Y ORG-MODE
#+date: \today
#+author: José Gaspar Sánchez Garcia
#+email: jg.sanchezgarcia@edu.gva.es

#+LICENSE: https://creativecommons.org/licenses/by-sa/4.0/
#+language: es
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 30.2 (Org mode 9.7.11)
#+description: Manual de referencia para el aprendizaje del uso de Emacs y Org-mode
#+keywords: Emacs, Org-mode, presentations, slides.
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/setup/html-theme-bigblow.setup
#+cite_export:

*** Mi primera formula
Vamos a introducir una formula en la tabla para que pueda calcular la media:
| Estudiante | 1ª Evaluación | 2ª Evaluación | 3ª Evaluación | Media           |
|------------+---------------+---------------+---------------+-----------------|
| Antonio    |            10 |            10 |            10 | :=vmean($2..$4) |
| Marcos     |             6 |             5 |            10 |                 |
| Andrés     |             4 |             4 |             4 |                 |
| Carla      |             4 |            10 |            10 |                 |


Presionamos ~C-c C-c~ sobre la formula para proceder a su cálculo:

| Estudiante | 1ª Evaluación | 2ª Evaluación | 3ª Evaluación | Media |
|------------+---------------+---------------+---------------+-------|
| Antonio    |            10 |            10 |            10 |    10 |
| Marcos     |             6 |             5 |            10 |     7 |
| Andrés     |             4 |             4 |             4 |     4 |
| Carla      |             4 |            10 |            10 |     8 |
#+TBLFM: $5=vmean($2..$4)

Finalmente, podemos añadir una fila con las medias de clase por evaluación:

| Estudiante | 1ª Evaluación | 2ª Evaluación | 3ª Evaluación | Media |
|------------+---------------+---------------+---------------+-------|
| Antonio    |            10 |            10 |            10 |    10 |
| Marcos     |             6 |             5 |            10 |     7 |
| Andrés     |             4 |             4 |             4 |     4 |
| Carla      |             4 |            10 |            10 |     8 |
|------------+---------------+---------------+---------------+-------|
| MEDIAS:    |             6 |          7.25 |           8.5 |  7.25 |
#+TBLFM: $5=vmean($2..$4)::@6$2=vmean(@2..@5)::@6$3=vmean(@2..@5)::@6$4=vmean(@2..@5)



